{
  "Aries": "You are ambitious, impatient and often find yourself taking initiative, never shying away from competition or a challenging situation.",
  "Taurus": "You are grounded and considered reliable by those around you. You value honesty and persistence and possess a taste for finer things in life.",
  "Gemini": "You are a fast moving target, buzzing from one social circle to the next, known for your creativity and sharp sense of wit.",
  "Cancer": "Your sense of purpose if fulfilled by nurturing those around you. Cancers often hide their grief, contempt and anger through their approachable exterior.",
  "Leo": "You are as charismatic as you are impulsive. Not afraid to share your own accomplishments, Leos mask their vulnerability with a radiant personality. You're unable to accept anything less than what you deserve.",
  "Virgo": "Your thoughtful habits leave lasting impressions. Though you possess a creative aptitude, you equally are meticulous in managing responsibilities.",
  "Libra": "You are a wonderful listener and have a disarming sense of charm. However, you have second thoughts and fear commitment in all facets of life.",
  "Scorpio": "You are assertive, direct and determined to deliver your point of view without fear or repercussions. Born a leader, your courage is often interpreted for overconfidence.",
  "Sagittarius": "You are unafraid to venture through uncharted waters and make mistakes in your journey. In your arsenal, you possess a piercing and unbridled honesty in every scenario.",
  "Capricorn": "You persevere to earn the respect of not only others but your own, often repressing emotions that stand in the way of success. You are motivated by duty and responsibility.",
  "Aquarius": "You are a nomad who is uncertain about laying down roots into one place or with one person. Valuing freedom, art and expression, you tend to question the status quo and follow your own heart.",
  "Pisces": "You are an empath who feels the emotions of those surrounding you quite intensely. Incredibly reluctant to follow through commitments is what you make up through your capacity for compassion."
}