{
    "Aries": "You are amibitious, impatient and often find yourself taking initiative, never shying away from competition or a challenging situation.",
    "Taurus": "You are grounded and considered reliable by those around you. You value honesty and persistance and possess a taste for finer things in life.",
    "Gemini": "You are a fast moving target, buzzing from one social circle to the next, known for your creativity and sharp sense of wit.",
    "Cancer": "Your sense of purpose if fufilled by nuturing those around you. Cancers often hide their grief, contempt and anger through their approachable exterior.",
    "Leo": "You are as charismatic as you are impulsive. Not afraid to share your accomplishments, Leos mask their vulnerability with a radiant personality. You're unable to accept anything less than what you deserve.",
    "Virgo": "Your thoughtful habits leave lasting impressions. Though you possess a creative aptitude, you equally are meticulous in managing responsibilities.",
    "Libra": "You are a wonderful listener and have a disarming sense of charm. You often have second thoughts and fear commitment in all facets of life.",
    "Scorpio": "Passionate, independent, and unafraid to blaze their own trail no matter what others think, Scorpio signs make a statement wherever they go. They love debates, aren't afraid of controversy, and won't back down from a debate. They also hate people who aren't genuine, and are all about being authentic—even if authentic isn't pretty.",
    "Sagittarius": "Independent and strong-willed, Sagittarius personalities are all about going off the beaten path. Sagittarius isn’t afraid to step away from the pack, and is a natural born leader who goes after what he or she wants, regardless of what other people think. Sagittarius is a born adventurer, and loves solo travel and exploration. Sagittarius also loves exploring the inner workings of their minds, and love stretching their horizons through a good book or movie.",
    "Capricorn": "Smart, hardworking, and fully in control of their destiny, Capricorn signs will always get what they set their mind to, in both personal and professional life—no excuses. Capricorns may get a reputation as stubborn, but they simply know what they want, and also know how they wish other people would behave.",
    "Aquarius": "Independent and enigmatical, Aquarians are unique. There is no one quite like an Aquarius, and because each is so incredibly individual, it can be tough to describe them as a group. Aquarians don't like labels, and may shy away from any adjective—even the good ones you might bestow upon them. Aquarians believe in the nature of change and evolution, and even though they're a fixed sign, they may not necessarily believe they are the \"same\" people they were when they were born.",
    "Pisces": "Smart, creative, and deeply intuitive, Pisces can be close to psychic. Pisces feel things deeply, and have incredibly strong gut reactions. A Pisces \"knows\" things from deep within, and can often judge whether a person or situation is good or bad. That doesn't mean a Pisces ignores the logical part of their brain, though. Deeply intelligent, Pisces have a profound respect for the power of the human mind. Is it a surprise that Albert Einstein was a Pisces?"
}